Repository: JianLaiTL/JianLai
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 陈平安笑了笑，“我知道了。”
en_us: "I see," Chen Ping'an replied with a smile, then turned and departed, quickly fading out of view.

source: 陈平安笑了笑，反过来劝慰少女，眼神真诚，清澈得如同小溪流水，“阮姑娘，你的好意，我心领了。我当然不会傻乎乎冲上去，直接跟那种神仙拼命。”
en_us: Chen Ping'an smiled, and his eyes were as clear and earnest as the flowing water of a creek as he said, "I know you're looking out for me, and for that, I thank you. Of course, I'm not just going to rush in recklessly to fight someone so much more powerful than myself."

source: 陈平安笑得合不拢嘴。
en_us: Chen Ping'an couldn't wipe the smile from his face.

source: 陈平安笑着不说话了，安安静静望向屋外的院子。
en_us: Chen Ping'an replied with a smile, staying silent as he gazed at the courtyard in front of his house.

source: 陈平安笑着嗯了yi声，没有多说什么。
en_us: Chen Ping'an replied with a smile. However, he didn't say anything.

source: 陈平安笑着摇了摇头。
en_us: Chen Ping'an smiled and shook his head.

source: 陈平安笑着摇头，好像根本就懒得跟她计较这类问题。
en_us: Chen Ping'an smiled and shook his head. It was as if he couldn't be bothered arguing with her about this.

source: 陈平安笑着点头，走向灶房，那男人则走向远处一间铸剑室。
en_us: Chen Ping'an smiled and nodded in response, then made his way to the kitchen, while the man departed toward a swordsmithing room in the distance.

source: 陈平安笑着跑出泥瓶巷，yi路上默念三小三大，按照记忆去模仿宁姚的走姿。
en_us: There was a smile on his face as he ran out of Clay Vase Alley. As he made his way to the creek, he silently recited the method of walking meditation to himself — three small steps and three big steps. He tried to emulate Ning Yao's movements.

source: 陈平安笑着转身，去箩筐里挑石头给小女孩。
en_us: Chen Ping'an smiled before turning around to pick a pebble for the little girl.

source: 陈平安笑道：“不聊这个，等下咱们到了铁匠铺，你千万别吊儿郎当的，能不能保住你家的宝甲，就看你能不能当上阮师傅的入门徒弟了。”
en_us: Chen Ping'an smiled and replied, "Let's talk about something else. When we get to the blacksmith forge, you definitely can't goof around like you always do. Whether or not you can keep that suit of armor passed down by your ancestors depends on whether or not you can become Master Ruan's disciple."

source: 陈平安笑道：“之前无意间遇上了齐先生，先生就跟我说了几句家常话，大致意思是当年我应该和刘羡阳，一起去学塾读书的。我只能说家里穷，没法子的事情，要不然我也愿意读书。”
en_us: Chen Ping'an smiled and said, "I also came across Mr. Qi by coincidence that time, and he merely made some small talk with me. He said that I should have gone to school with Liu Xianyang when I was younger. I could only tell him that my family was too poor, so that would have been impossible. Otherwise, I would have also liked to go to shool."

source: 陈平安笑道：“反正我背着一筐石头，还能比你先跑回小镇。”
en_us: Chen Ping'an smiled and replied, "No matter what, I can run back to town faster than you even with a basket full of rocks on my back."

source: 陈平安笑道：“只要你搬得动，就送你块最大的。不过这里到小镇，再到家里，可不近。而且我觉得箩筐里这些大的，不如小的好。”
en_us: Chen Ping'an smiled and replied, "As long as you're able to carry it, I can even give you the biggest one. However, this place is quite far away from the small town and your home. Moreover, I feel like the bigger pebbles in the basket aren't actually as good as the smaller ones."

source: 陈平安笑道：“好人有好报。”
en_us: Chen Ping'an smiled and said, "Good people will always be blessed with good karma."

source: 陈平安笑道：“好的，可是宁姑娘记得小心些，这本撼山谱，我以后还要原原本本还给顾粲的。”
en_us: Chen Ping'an smiled and replied, "Sure thing. However, remember to be careful with the book. After all, I still have to return it to Gu Can in the future."

source: 陈平安笑道：“宁姑娘你要是想要，我能给你一天捡一大箩筐来，我们这边没谁待见这个，就顾粲喜欢，经常自己一个人去捡。”
en_us: Chen Ping'an smiled and replied, "If you want, I can collect a large basketful of them for you every day. Apart from Gu Can, no one here likes these pebbles. Only he frequents the creek to collect these pebbles."

source: 陈平安笑道：“宁姑娘，送你的。”
en_us: Chen Ping'an smiled and said, "It's a present for you, Ning Yao."

source: 陈平安笑道：“对，就这个。你知道我家地方吧？”
en_us: Chen Ping'an smiled and replied, "That's it. You know where my house is, right?"

source: 陈平安笑道：“应该是我疑神疑鬼了。”
en_us: "I'm probably just being too paranoid then," Chen Ping'an said with a smile.

source: 陈平安笑道：“我确定！”
en_us: "I'm certain!" Chen Ping'an replied with a smile.

source: 陈平安笑道：“新任督造官比较照顾宋集薪，是小镇所有人都知道的事情，你在这里疑神疑鬼做什么？”
en_us: Chen Ping'an smiled and said, "Everyone knows that the new kiln supervision official is quite caring for Song Jixin. What are you acting all suspicious for?"

source: 陈平安笑道：“那就到时候再说。”
en_us: "Then we'll talk about it then," Chen Ping'an replied with a smile.

source: 陈平安笑道：“那这三条就都给你好了。之后我再抓。”
en_us: Chen Ping'an smiled and said, "Then I'll give these three fish to you. I'll catch some more later."

source: 陈平安笑道：“麻烦阮姑娘你了。”
en_us: "I'll have to trouble you then, Ruan Xiu," Chen Ping'an replied with a smile.

source: 陈平安笑问道：“宁姑娘，你没有觉得做完这些后，心里很舒服吗？”
en_us: Chen Ping'an smiled and asked, "Ning Yao, don't you feel very at ease after doing this?"

source: 陈平安笑问道：“就不怕鼻涕虫堵在你们门口骂半天？”
en_us: "Are you not worried about that snotty little kid coming over to give you a piece of his mind?" Chen Ping'an chuckled.

source: 陈平安笑问道：“那你叫什么？”
en_us: "What's your name?" Chen Ping'an asked wit ha smile.

source: 陈平安答道：“听刘羡阳说是咱们小镇的现任窑务督造官，人挺和气的，刚才在巷口那边，还给我让了路。”
en_us: "I heard Liu Xianyang say that he's our new kiln supervision official. He seems like a fairly polite person, and he even shuffled over for me to pass in the alley just then," Chen Ping'an replied.

source: 陈平安答非所问，开心道：“今年清明节，我还能给爹娘上坟，真好。”
en_us: Chen Ping'an offered a response, but not to the question being raised. A joyful look appeared on his face as he mused, "It's great that I'll still be able to visit my parents' graves on the Tomb Sweeping Festival this year."

source: 陈平安纳闷道：“阮师傅催你还箩筐啦？”
en_us: Chen Ping'an was slightly puzzled, and he said, "Master Ruan has been nagging you to return the bamboo basket?"

source: 陈平安纹丝不动，“然后呢？”
en_us: "What do I do after that?" Chen Ping'an asked.

source: 陈平安绕过少年，说了声我先走了，然后背起箩筐就上岸。
en_us: Chen Ping'an walked around the young boy and told him that he was going to leave first. He then picked up his baskets and turned around to leave.

source: 陈平安给出答案，“竹筒总共有八个，其中六个，每截竹筒里放了四个白米饭团，还有两个，装了一些不容易坏的腌菜。”
en_us: "There are eight tubes of bamboo in total, and six of them are filled with four riceballs each. The other two are filled with difficult to perish pickled vegetables," Chen Ping'an replied.

source: 陈平安给气得脸色铁青，扬起手就要来个货真价实的板栗，只不过看到孩子死犟死犟的表情，陈平安又有些心软，缓了缓语气，想了想，问道：“到底是怎么回事，你给我说说。”
en_us: An angry expression spread across Chen Ping'an's face. He raised his hand and was just about to give Gu Can a true smack on the head. However, seeing his extremely stubborn expression, Chen Ping'an couldn't help but feel soft-hearted. He pondered for a moment before softening his voice and asking, "What's going on? Tell me what's happening."

source: 陈平安给看得心慌，“咋了？”
en_us: Chen Ping'an was slightly flustered, and he asked, "What's wrong?"

source: 陈平安给黑衣少女端去药汤的时候，隔壁院子竟然还在断断续续劈柴，陈平安在宁姑娘喝药的时候，忍不住走到院墙旁，踮脚望去，发现稚圭正拎着把菜刀，在砍杀“一个人”，是木头制成的胚子，陈平安烧瓷多年，见过的好东西不少，砍过的树木更是不计其数，所以一眼就看出大致深浅，那木头色泽如玉，肯定是很老的物件，而且木偶身上布满密密麻麻的红点黑点，木偶已经被稚圭连砍带剁，给劈成了好多截。
en_us: When Chen Ping'an brought the bowl of medicine to Ning Yao, he could surprisingly still hear the intermittent sound of hacking coming from next door. While Ning Yao drank her medicine, Chen Ping'an couldn't help but walk to the courtyard wall and get on his tippy-toes. He discovered that Zhi Gui was hacking at a "person" with a kitchen knife. This was a small wooden person. Chen Ping'an had worked in the kilns for many years, so he had seen many high-quality products and also chopped a countless amount of wood. Thus, he was able to determine the quality of the wood with a single glance. The wood was as smooth and glossy as jade, and this signified that the wooden person was definitely an ancient item. Moreover, the wooden person was covered in red and black dots. However, it had already been hacked into several pieces by Zhi Gui.

source: 陈平安给黑衣少女送去早餐，直接给刘羡阳拿去三个，自己只咬着一个。
en_us: Chen Ping'an handed two of the buns to Ning Yao for breakfast. Liu Xianyang directly took three of them, leaving only one for Chen Ping'an to eat.

source: 陈平安继续伸着手。
en_us: Chen Ping'an continued to hold his hand aloft.

source: 陈平安继续前行，看不出异样。
en_us: Chen Ping'an continued to walk forward, not showing any signs of feeling unwell.

source: 陈平安继续去往城东门，哪怕要不到钱，催一催也是好的。
en_us: Meanwhile, Chen Ping'an continued on toward the eastern town gate. Even if he couldn't get the money, it was always definitely a good idea to exert some pressure on the gatekeeper.

source: 陈平安继续来来回回搬运积土，十数次后，马尾辫少女已经不见踪迹，不过井口上留着帕巾和一块糕点，是压岁铺子最著名的桃花酒酿糕，陈平安愣了愣，只好摘下背篓，放在脚边，坐在帕巾附近的井口上，在衣衫上擦了擦手，双指捻起糕点，放入嘴中。
en_us: Meanwhile, Chen Ping'an continued to transport soil out of the well, and after around a dozen trips, Ruan Xiu was already nowhere to be seen, but she had left a piece of pastry for him sitting atop her handkerchief on the edge of the well. It was the most renowned pastry sold in the shop on Dragon Riding Alley, the peach blossom wine cake. Chen Ping'an faltered slightly upon seeing this, then removed the basket from his back and set it down by his feet. He sat down on the edge of hte well near the handkerchief, then rubbed his hands on his clothes before plucking the cake between two of his fingers and placing it into his mouth.

source: 陈平安缓缓前行，耳边仿佛有狐魅女子细语呢喃，蛊惑人心，“跪下吧，便可鸿运当头。”
en_us: Chen Ping'an slowly made his way onward, and a seductive female voice rang out beside his ears. "Kneel and you shall be blessed with fortune beyond your wildest dreams."

source: 陈平安缓缓抬起头，手上动作并未停歇，依然很稳，眼神示意她稍等片刻。
en_us: Chen Ping'an raised his head to look at her, indicating with his eyes for her to wait for a moment, but he didn't stop what he was doing, and his hands remained as stable as ever.

source: 陈平安缓缓起身，欲言又止，刘羡阳笑骂道：“陈平安你大爷的，我卖的是你的传家宝？还是你媳妇啊？”
en_us: Chen Ping'an slowly stood up. He wanted to say something, yet he eventually swallowed his words. Liu Xianyang smiled and scolded, "Bloody hell, Chen Ping'an, am I selling your family heirloom or my family heirloom? Or perhaps I'm selling your wife?"

source: 陈平安翻了个白眼，“有本事你当着宁姑娘的面说”
en_us: Chen Ping'an rolled his eyes, saying, "If you're so capable, why don't you say that to her face?"

source: 陈平安翻了个白眼，对这些尖酸刻薄的言语，少年并不以为意，一来生活在这座总共没几本书籍的乡野地方，如果被人骂几句就恼火，干脆找口水井跳下去得了，省心省事。二来这个看门的中年光棍，本身就是个经常被小镇百姓取笑打趣的对象，尤其是那些胆大泼辣的妇人，别说嘴上骂他，动手打他的都有不少。加上这人还极其喜欢跟穿开裆裤的小孩吹牛，比如什么老子当年在城门口，好一场厮杀，打得五六个大汉满地找牙，满地都是血，城门前整条两丈宽的道路，就跟下雨天的泥泞道路差不多！
en_us: Chen Ping'an rolled his eyes in response, completely unfazed by the man's scathing words. He was living in a rural area filled with uneducated people, if he allowed himself to get mad everytime someone directed some insults at him, then he may as well jump into a well and put himself out of his misery. In addition to that, this middle-aged gatekeeper was often the butt of jokes for the residents of the town himself. In particular, the bold and feisty women would not just verbally abuse him, but often hit him as well. The man was also always going around boasting to little kids who were still in their open crotch pants, telling them about how back in his heyday, he had once beaten up five or six burly men at once in front of the town gate, dishing out such a severe beating that his assailants were left to pick up their teeth from the ground, and that there was so much blood everywhere that the entire 20-foot wide path in front of the town gate had become as muddy as if it had just rained!

source: 陈平安耐得住性子发呆，邋遢汉子好像觉得多半是没法子蒙混过关了，睁眼笑道：“不就五文钱嘛，男人这么小气，以后不会有大出息的。”
en_us: Chen Ping'an had the patience to stick around in silence, and it seemed that the gatekeeper could sense that he wouldn't be able to get out of this just by ignoring him. Hence, he opened his eyes and smiled as he said, "Get over it, it's just five copper coins! A young man shouldn't be so petty. Otherwise, you'll never make anything out of yourself."

source: 陈平安肚子疑惑，加快步子离开泥瓶巷，回望眼，男人已经缓缓走入泥瓶巷。
en_us: Chen Ping'an was extremely puzzled as he quickened his pace and left Clay Vase Alley. Glancing back, he saw that the man had already slowly entered Clay Vase Alley.

source: 陈平安背对屋子，望向门口，道：“我想知道，她为什么要杀我，我们明明才第一次见面。”
en_us: Chen Ping'an turned to cast his gaze out the door as he said, "I just want to know why she did that to me. That was the first time that we met, so what reason did she have to kill me?"

source: 陈平安背着箩筐，站在宁姚暂住的那栋屋子檐下，抿起嘴唇。
en_us: Chen Ping'an stood under the eave of the earthen hut that Ning Yao had been staying in, and a slightly dejected look appeared on her face.

source: 陈平安背起少女往屋内走，将她轻轻放在垫有被褥的木板床上，先前被刘羡阳一屁股坐塌的木板床，刚刚修好没多久，床底下垫了根板凳。
en_us: Chen Ping'an hoisted the young woman onto his back, then made his way into his house before gently placing her down onto his plank bed, which was covered by a thin blanket. The bed had only just been repaired after it had been snapped by Liu Xianyang, and there was a bench tucked under the bed for support.

source: 陈平安背起箩筐上岸后，往青牛背那边走去，不知道是不是错觉，少年觉得小溪水位好像下降了一些。
en_us: After returning onshore with the bamboo basket on his back, Chen Ping'an started to walk toward the Azure Cow Ridge. Perhaps it was a false impression, but the young boy felt like the water in the creek had lowered a little.

source: 陈平安背起箩筐，小心翼翼下了巨石，上岸后，缓缓向廊桥那边行去。
en_us: Chen Ping'an slung the bamboo basket over his shoulders and carefully climbed down from the large rock. After returning onshore, he slowly made his way toward the covered bridge.

source: 陈平安背起箩筐，跟年轻道姑告辞离去，朝小女孩挥了挥手，独自小跑返回小镇。
en_us: Chen Ping'an slung the bamboo basket over his shoulders and bade farewell to the young Daoist nun. He didn't forget to also wave goodbye to the little girl as he ran back to the small town by himself.

source: 陈平安背起背篓后，有些不放心，看着刘灞桥问道：“知道回去的路吗？”
en_us: Chen Ping'an picked up his bamboo basket, but he still felt a little worried. He looked at Liu Baqiao and asked, "Do you remember the way back?"

source: 陈平安脑子里的第一个印象，少女应该饿死鬼投胎吧，才会大半夜饿得这么可怜兮兮。
en_us: Chen Ping'an's first thought was that this young girl had most likely been starved to death in her previous life. It was because of this that she was still so pitifully hungry in the middle of the night.

source: 陈平安脱掉那件原本属于刘羡阳的的外衫，摘下那件木瓷甲，从腰间一只布囊拿出杨家铺子的瓷瓶，倒出一些浓稠药膏，倒在右手手心，左手提起衣衫，右手涂抹在后背上。
en_us: Chen Ping'an took off the robe that belonged to Liu Xianyang, then removed that suit of wood porcelain armor as well. After that, he pulled a porcelain vial from the Yang Family's medicine shop out of a cloth pouch tied to his waist, then poured out a viscous ointment onto the palm of his right hand. With his left hand lifting up the hem of his shirt, he used his right hand to apply the ointment to his own back.

source: 陈平安脸色微变，眉头紧皱，转头望向屋内，问道：“宁姑娘，作为交换，三袋子金精铜钱，行不行？还有就是，会不会让你有大麻烦，这一点，请你务必事先说清楚。”
en_us: Chen Ping'an's expression changed slightly. He frowned before turning around and asking, "Ning Yao, will three pouches of gold essence copper coins suffice as payment? Also, will this be too troublesome for you? Please tell me the truth."

source: 陈平安脸色晦暗，“以前怎么都想不通，后来刘羡阳跟我说，姚老头说跳-刀这门手艺，想要做到最好，一定要心稳，而不仅仅是手稳。我听到这些话后，就有些明白了。我之前太着急，越心急，手越乱，越乱就越容易出错，一出错，我看得一清二楚，知道自己哪里做得不像姚老头，接下去就更心急，所以在龙窑那边拉坯，我一直是最差的。”
en_us: A slightly dejected look surfaced in Chen Ping'an's eyes as he replied, "In the past, I was unable to figure it out no matter how much I thought about it, but later, Liu Xianyang told me something that Old Man Yao told him, which was that in order to execute the jumping burin technique well, one has to have a steady heart, not just a steady hand. After that, I began to understand what I was doing wrong. In the past, I was too hasty, and the more hasty I was, the less steady my hands were, the more mistakes I made. After making mistakes, I would become even more dismayed because I knew what I was doing wasn't like Old Man Yao at all, and it was a negative cycle that compounded on itself. That's why I was always the worst at pottery molding at the dragon kiln."

source: 陈平安脸色认真道：“如果可以的话，是最好。”
en_us: Despite the clear mockery in Ning Yao's voice, Chen Ping'an replied with an earnest expression, "It would be great if you could do that."

source: 陈平安脸茫然。
en_us: Chen Ping'an shook his head with a blank expression.

source: 陈平安腼腆笑，摇摇头。
en_us: Chen Ping'an wore a bashful smile as he shook his head.

source: 陈平安自然没有异议，毫不拖泥带水就照做了，背起少女继续奔跑，问道：“宁姑娘，你的刀呢？怎么只有刀鞘？”
en_us: Chen Ping'an naturally didn't have any objections. He put Ning Yao down and shifted her onto his back without any hesitation before running off again. "Ning Yao, where's your saber? Why do you only have your saber scabbard?" he asked.

source: 陈平安自然看不出年轻道长这一手字的韵味深浅、造诣高低，也不会因为宁姚的评价不高，就轻视了这三张纸。再者陆道长临行之前亲口说过，小镇购书识字大不易，陈平安想要学字，可以从他的药方学起，
en_us: Chen Ping'an was naturally unable to gauge the quality and expertise of Daoist Lu's handwriting, nor was he going to take these three sheets of paper lightly just because of Ning Yao's comments. Prior to his departure, Daoist Lu had told him that it was not going to be easy to purchase books in the town, so this medicinal recipe was a good tool for Chen Ping'an to learn how to read and write.

source: 陈平安自言自语道：“懂了。”
en_us: "I understand," Chen Ping'an said.

source: 陈平安若有所思。
en_us: Chen Ping'an mulled over these words.

source: 陈平安若有所思，“我懂了。”
en_us: Chen Ping'an mulled over this for a moment before saying, "I understand."

source: 陈平安苦笑道：“对付老猿，意义不大，反而会影响到我的跑路速度，就干脆脱掉了。也亏得如此，不然我都不知道怎么带你离开那边，扛不能扛，背也不能背，抱更不能抱，想想都头疼。”
en_us: Chen Ping'an smiled bitterly and said, "It's not very useful against that old ape, and instead of helping, it will even slow me down. So I decided to take it off. Thankfully I did, or else I don't know how I would have carried you away. I wouldn't have been able to carry you on my shoulder or back, nor would I have been able to carry you in my arms. Just thinking about it is giving me a headache."

source: 陈平安苦笑道：“还不真是钱的事情，我就跟你直说了吧，刘羡阳给人在廊桥那边打成重伤了，杨家铺子的老掌柜去看了，也没辙。”
en_us: A wry smile appeared on Chen Ping'an's face as he replied, "Unfortunately, it's not a matter of money. What happened is that Liu Xianyang was severely injured by someone over at the covered bridge, and even Shopkeeper Yang from the medicine shop has no way to save him."

source: 陈平安茫然道：“宁姑娘，其实我一直想问，这剑炉说是拳谱的立桩，可手指这么扭来扭去，这和练拳到底有啥关系？能长力气吗？”
en_us: Chen Ping'an was baffled, and he said, "Ning Yao, I've always wanted to ask you something. You say that the Sword Furnace relates to the standing meditation of the fist technique, but how does twisting my fingers around relate to practicing a fist technique? Can it increase my strength?"

source: 陈平安莫名其妙问道：“煎药你不觉得烦？”
en_us: Chen Ping'an replied with an inexplicable question, saying, "You don't find brewing medicine annoying?"

source: 陈平安蓦然回头，望向溪水。
en_us: Chen Ping'an turned to look at the creek, and nothing appeared to be amiss.

source: 陈平安藏起瓷片，加快脚步，和儒士并肩而行，抬头问道：“齐先生，我能问一个问题吗？”
en_us: Chen Ping'an hid away the shard of porcelain as he quickened his pace, walking side-by-side with the scholar. He raised his head and asked, "Mr. Qi, can I ask you a question?"

source: 陈平安虽然好奇她的身份，但也没有多嘴询问，看她穿着打扮，不像是福禄街桃叶巷那边的大家闺秀，倒是有些像是隔壁邻居的稚圭，秀里秀气的，也不爱说话。陈平安突然有些担心，她不会是偷了家里东西出来吃的小丫鬟吧，听说那些大宅里的规矩厉害得很，刘羡阳和宋集薪两人总喜欢反着说话，唯独在这件事情倒是例外，只不过刘羡阳的说法很吓人，说是丫鬟婢女在那些院墙高高的宅子里头，一个走路姿势不对，就会被眼睛跟捕蛇鹰一样好的管家派人打断腿，丢到墙外的街上等死。宋集薪则说刘羡阳以讹传讹，才没那么夸张，只不过大家门户里的丫鬟嬷嬷，确实走路都跟猫似的，听不着半点声音。当时刘羡阳瞥见一旁偷着乐的婢女稚圭，立即就恼羞成怒了，大骂宋集薪鹅什么鹅，你家的鹅能说话啊？
en_us: Even though Chen Ping'an was curious about her identity, he didn't inquire her about who she was. Judging by her outfit, she didn't look like the darling daughter of some rich family in Peach Leaf Alley. Instead, she appeared more similar to the neighboring Zhi Gui. She was pretty, but she didn't like to speak. Chen Ping'an suddenly felt a little worried. She wasn't a maidservant who had stolen some food and sneaked out to enjoy it, right? He had heard that those large families were extremely strict. Liu Xianyang and Song Jixin always liked to disagree with each other, but when it came to this matter, they were suprisingly united in agreement. However, Liu Xianyang's explanation had been especially frightening. He said that inside the tall walls of those homes, the maidservants would be watched like prey by the hawk-eyed housekeepers. If their manner of walking was off by just a little, the housekeepers would immediately command someone to break their legs and toss them outside, where they would wait for death to arrive. However, Song Jixin had accused Liu Xianyang of false information, saying that it wasn't so extreme. Even so, he agreed that the maidservants in these large families did indeed have to tip toe around like cats. They weren't allowed to make any sound when they walked. Upon seeing Zhi Gui secretly chuckling in delight, Liu Xianyang's embarrassment had immediately turned into anger, causing him to curse at Song Jixin.

source: 陈平安虽然把孩子强行拽回来，但是如何处置，犹豫不决，涉及到的事情太大，陈平安很怕做出错误的选择，害得顾粲和他娘亲被连累。
en_us: Even though Chen Ping'an had dragged the little boy back, he was still hesitant about how to deal with the situation. This was a matter with great consequence, so Chen Ping'an was extremely afraid of making an incorrect decision and ultimately bringing harm to Gu Can and his mother.

source: 陈平安虽然没读过书，但依然觉得这个词语，肯定是分量很重的称呼。
en_us: Chen Ping'an had never read any books, but he could still feel the weight behind the saying.

source: 陈平安虽然看着身形瘦弱，可是当他双肩扛起那些槐枝，一点也不勉强地轻松走在泥瓶巷，把后头那位红棉袄小姑娘，给看得目瞪口呆，之前如果不是她坚持，陈平安连她纤细肩膀上的那根槐枝也要一并拿去。
en_us: Even though Chen Ping'an had a thin and frail-looking body, he wasn't struggling at all as he carried the locust branches on his shoulders, making his way down Clay Vase Alley as if there were nothing more than a feather sitting on his shoulder. Li Baoping was trailing along behind him, and she was astonished to see this. If it weren't for her insistence, Chen Ping'an would've taken the locust branch on her delicate shoulder as well.

source: 陈平安被她的古怪眼神给看得浑身不对劲，试探性问道：“你想要这些鱼？”
en_us: Chen Ping'an felt extremely uncomfortable under her strange gaze, so he asked in an uncertain voice, "You want these fish?"

source: 陈平安被这一脚踢得倒飞出去，只不过重心极低，又护住了要害，并没有出现鲜血淋漓的画面。
en_us: Chen Ping'an was sent flying by Ma Kuxuan's kick. However, his center of gravity had been extremely low, and he had also protected his weak points, so the outcome wasn't a bloody and miserable one.

source: 陈平安觉得刘灞桥这个人，不坏。
en_us: Chen Ping'an felt like Liu Baqiao wasn't a bad person.

source: 陈平安觉得可能性不大。
en_us: Chen Ping'an felt like the probability of this was small.

source: 陈平安觉得自己应该也用得着。
en_us: Chen Ping'an had a feeling that this medicine would come in useful.

source: 陈平安让宁姚稍等，率先弯腰进入木草搭建的临时小窝，略作收拾，这才开门迎客。
en_us: Chen Ping'an told Ning Yao to wait for a moment as he bent down and entered the small hut. After tidying it up a little, he opened the door and invited her in.

source: 陈平安识趣地闭嘴不言，以免火上浇油。
en_us: Chen Ping'an smartly kept his mouth shut, lest he add fuel to the fire.

source: 陈平安试探性问道：“喂，你能说话不？或者能听懂我说话吗？”
en_us: "Hey, can you speak? Can you understand what I'm saying?" Chen Ping'an asked in a tentative voice.

source: 陈平安说出自己的yi个想法，“在溪水里练习走桩，是不是也行？”
en_us: "Is it possible to practice walking meditation in the creek?" Chen Ping'an asked. This was something that he had thought of before.

source: 陈平安说着说着，突然意识到自己说的话有些不吉利，听着不像是好话，反倒是泥瓶巷顾粲他娘，最擅长的那种咒人的混账话，陈平安很快就闭上嘴巴，不再唠叨了，加快脚步，向北跑向小镇。
en_us: As he said this, Chen Ping'an suddenly felt like his words were slightly ominous and ill-omened. It didn't sound like a reminder, and it instead sounded more like the curses spoken by Gu Can's mother. Chen Ping'an quickly shut his mouth, not waffling on anymore. He quickened his pace and ran north toward the small town.

source: 陈平安说道：“不急，等那两拨人死心离开小镇再说，这段时间我帮你看家。”
en_us: "There's no hurry," Chen Ping'an replied. "We'll talk about it after those two groups of people give up and leave the small town. In the meantime, I'll help you look after your house."
